#include <stdio.h>
#include <iostream>
#include <math.h>
#include <string>

using namespace std;

int main(){
    cout << "\n Задание 1. \n";
    int d, m;
    string nmbr[] = {"первое", "второе", "третье", "четвертое", "пятое", "шестое", "седьмое", "восьмое", "девятое", "десятое", "одиннадцатое", "двенадцатое", "тринадцатое", "четырнадцатое", "пятнадцатое", "шестнадцатое", "семнадцатое", "восемнадцатое", "девятнадцатое", "двадцатое", "двадцать первое", "двадцать второе", "двадцать третье", "двадцать четвертое", "двадцать пятое", "двадцать шестое", "двадцать седьмое", "двадцать восьмое", "двадцать девятое", "тридцатое", "тридцать первое"};
    string mnth[] = {"января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря"};
    cout << "Введите номер дня(от 1 до 31): ";
    cin >> d;
    cout << "Введите номер месяца(от 1 до 12): ";
    cin >> m;
    if ((m == 2 and d > 29) or (m == 4, 6, 9, 11 and d > 30)){
        cout << "Ошибка! Неверно введена дата.";
    }
    cout << nmbr[d - 1] << " " << mnth[m - 1] << "\n";
}