#include <stdio.h>
#include <iostream>
#include <math.h>
#include <string>

using namespace std;

int main(){
    cout << "\n Задание 2. \n";
    string c, n;
    cout << "Введите исходное направление робота (З - запад, Ю - юг, В - восток, С - север): ";
    cin >> c;
    cout << "Введите команду для робота (0 - продолжать движение, 1 - поворот налево, -1 - поворот направо): ";
    cin >> n;
    if (c == "З"){
        c = "на запад";
    }
    else if (c == "Ю"){
        c = "на юг";
    }
    else if (c == "В"){
        c = "на восток";
    }
    else if(c == "З"){
        c = "на запад";
    }
    if (n == "0"){
        n = "продолжать движение";
    }
    else if (n == "1"){
        n = "повернуть налево";
    }
    else if (n == "-1"){
        n = "повернуть направо";
    }
    cout << n << " " << c << "\n";
}