#include <stdio.h>
#include <iostream>
#include <math.h>
#include <string>

using namespace std;

int main(){
    cout << "\n Задание 3. \n";
    int n;
    string nmbr[] = {"десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать", "двадцать", "двадцать одно", "двадцать два", "двадцать три", "двадцать четыре", "двадцать пять", "двадцать шесть", "двадцать семь", "двадцать восемь", "двадцать девять", "тридцать", "тридцать одно", "тридцать два", "тридцать три", "тридцать четыре", "тридцать пять", "тридцать шесть", "тридцать семь", "тридцать восемь", "тридцать девять", "сорок"};
    cout << "Введите колличество заданий: ";
    cin >> n;
    if (n == 10 or n == 11 or n == 12 or n == 13 or n == 14 or n == 15 or n == 16 or n == 17 or n == 18 or n == 19 or n == 20 or n == 25 or n == 26 or n == 27 or n == 28 or n == 29 or n == 30 or n == 35 or n == 36 or n == 37 or n == 38 or n == 39 or n == 40){
        cout << nmbr[n - 10] << " учебных заданий \n";
    }
    else if (n == 21 or n == 31){
        cout << nmbr[n - 10] << " учебное задание \n";
    }
    else if (n == 22 or n == 23 or n == 24 or n == 32 or n == 33 or n == 34){
        cout << nmbr[n - 10] << " учебных задания \n";
    }
    else{
        cout << "Ошибка! Неверно введено количество заданий. \n";
    }
}